ТОИР_демо/src/Documents/торо_ПрисвоениеКвалификацийСотрудникам/торо_ПрисвоениеКвалификацийСотрудникам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_ПрисвоениеКвалификацийСотрудникам</name>
  <registerRecords>InformationRegister.торо_КвалификацияРемонтногоПерсонала</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.торо_ВидыОперацийСКвалификациями</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КвалификацииСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>CatalogRef.торо_КвалификацииРемонтногоПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>Основная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НоваяОсновная</name>
      <type>
        <types>CatalogRef.торо_КвалификацииРемонтногоПерсонала</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ТОИР_демо/src/InformationRegisters/торо_КвалификацияРемонтногоПерсонала/торо_КвалификацияРемонтногоПерсонала.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_КвалификацияРемонтногоПерсонала</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Основная</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Удаленная</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Квалификация</name>
    <type>
      <types>CatalogRef.торо_КвалификацииРемонтногоПерсонала</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТОИР_демо/src/Enums/торо_ВидыОперацийСКвалификациями/торо_ВидыОперацийСКвалификациями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ВидыОперацийСКвалификациями</name>
  <enumValues>
    <name>ПрисвоениеКвалификаций</name>
  </enumValues>
  <enumValues>
    <name>УдалениеКвалификаций</name>
  </enumValues>
</mdclass:Enum>

ТОИР_демо/src/Documents/торо_ПрисвоениеКвалификацийСотрудникам/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПЕРЕМЕННЫЕ

перем СтруктураДанных Экспорт;  // Структура, хранящая данные для работы с уведомлениями.
Перем БезусловнаяЗапись Экспорт; // Отключает проверки при записи документа

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	
	
	
	Если КвалификацииСотрудников.Количество() = 0 Тогда
		торо_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'В документе не заполнена табличная часть квалификаций сотрудников. Проведение невозможно!'"));
		Отказ = истина;
		Возврат;
	КонецЕсли;
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = Строка(Ссылка);
	
	Если Не Отказ Тогда
		
		Если ВидОперации = Перечисления.торо_ВидыОперацийСКвалификациями.УдалениеКвалификаций Тогда
			
			Для Каждого СтрокаТЧ Из КвалификацииСотрудников Цикл
				
				// регистр торо_КвалификацияРемонтногоПерсонала 
				Движение = Движения.торо_КвалификацияРемонтногоПерсонала.Добавить();
				Движение.Период       = Дата;
				Движение.Сотрудник    = СтрокаТЧ.Сотрудник;
				Движение.Квалификация = СтрокаТЧ.Квалификация;
				Движение.Удаленная 	  = Истина;
				
				// Перевыбор основной квалификации
				Если ЗначениеЗаполнено(СтрокаТЧ.НоваяОсновная) Тогда
					
					Движение = Движения.торо_КвалификацияРемонтногоПерсонала.Добавить();
					Движение.Период       = Дата;
					Движение.Сотрудник    = СтрокаТЧ.Сотрудник;
					Движение.Квалификация = СтрокаТЧ.НоваяОсновная;
					Движение.Основная 	  = Истина;
					
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			Для Каждого СтрокаТЧ Из КвалификацииСотрудников Цикл
			
				// регистр торо_КвалификацияРемонтногоПерсонала 
				Движение = Движения.торо_КвалификацияРемонтногоПерсонала.Добавить();
				Движение.Период       = Дата;
				Движение.Сотрудник    = СтрокаТЧ.Сотрудник;
				Движение.Квалификация = СтрокаТЧ.Квалификация;
				Движение.Основная = СтрокаТЧ.Основная;
				
				Если СтрокаТЧ.Основная И ЗначениеЗаполнено(СтрокаТЧ.НоваяОсновная)
					И СтрокаТЧ.Квалификация <> СтрокаТЧ.НоваяОсновная Тогда
					Движение = Движения.торо_КвалификацияРемонтногоПерсонала.Добавить();
					Движение.Период       = Дата;
					Движение.Сотрудник    = СтрокаТЧ.Сотрудник;
					Движение.Квалификация = СтрокаТЧ.НоваяОсновная;
					Движение.Основная = Ложь;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Движения.торо_КвалификацияРемонтногоПерсонала.Записать();
		
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#КонецЕсли
